package com.jslee.classes;

public class Class {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/* 클래스는 틀,객체를 생성하는 것이다.
		// 성적 관리 프로그램
		이름, 학번, 주소, 연락처 .. 국/영/수 점수, 총점, 평균, 결과(학점)..
		입력하기, 계산하기, 출력하기 ..
		
		class 성적관리{
			String 이름;
			int 국,영,수;
			double 평균;
			// 메소드까지 필드에 입력해서 동작하는 행위들을 입력시켜줘야한다.
			void 입력하기(){
			}
			void 계산하기(){
			}
			void 출력하기(){
			}
		}
		
		성적관리 학생1 = new 성적관리();
		학생1.이름 = "ㅁㅁㅁ";
		할생1.국 = 100;
		
		class 은행고객관리{
			String 고객이름;
			String 계좌번호;
			int 잔고;
		}
		
		은행고객관리 고객1 = new 은행고객관리(); // 고객1 : 객체(object)
		고객1.고객이름 = "철수";
		고객1.계좌번호 = "134565";
		
		은행고객관리 고객2 = new 은행고객관리(); // 고객2 : 객체(object)
		고객2.고객이름 = "영희;
		고객2.계좌번호 = "54354353";
		 
		 한 파일에 여러개의 클래스를 붙일 수는 있지만 파일명은 메인 메소드가 포함되어 있는 클래스의 이름으로 지정해야 한다.
		 */

	}

}
